archive/before-2018-11-10/2017-06-27-ip_forward和rp_filter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><code>ipforward</code> 和 <code>rp_rilter</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title"><code>ipforward</code> 和 <code>rp_rilter</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#ip_forward">1. ip_forward</a></li>
<li><a href="#org9d2aefe">2. rp_filter</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf1ad822" class="outline-2">
<h2 id="ip_forward"><a id="orgf1ad822"></a><span class="section-number-2">1</span> ip_forward</h2>
<div class="outline-text-2" id="text-ip_forward">
<pre class="example">
    IP forwarding should be enabled when you want the system to act as a
    router, that is transfer IP packets from one network to another.

    In the simplest case, consider a server with two physical ethernet
    ports which is meant to connect to two different networks (say your
    internal network and the outside world as provided by a DSL modem). If
    you just connect and configure those two interfaces, the system can
    communicate on either network. However, packets from one network
    cannot travel to the other network, because forwarding is not enabled.
</pre>

<p>
打开 <code>ip forward</code> 选项，系统可以像路由器一样工作，它可以把ip包从一个
网络传到另一个网络。
</p>

<p>
具体例子见下图：
</p>
<div class="org-src-container">
<pre class="src src-artist">                     _           __                                  _
                    (_)_ __     / _| ___  _ ____      ____ _ _ __ __| |
                    | | '_ \   | |_ / _ \| '__\ \ /\ / / _` | '__/ _` |
                    | | |_) |  |  _| (_) | |   \ V  V / (_| | | | (_| |
                    |_| .__/___|_|  \___/|_|    \_/\_/ \__,_|_|  \__,_|
                      |_| |_____|

    +----+-----------------+----+              +----+-----------------+----+           +----+-----------------+----+
    |    |                 |    |              |    |                 |    |           |    |                 |    |
    |    |   Host 1        |eth0+--------------+eth0|    Host 2       |eth1+-----------+eth0|      Host 3     |    |
    |    |                 | |  |              |  | |                 |  | |           |  | |                 |    |
    +----+-----------------+-+--+              +--+-+-----------------+--+-+      o    +--+-+-----------------+----+
                             |                    |                      |                |
                             v                    v                      v                v
                       192.168.56.8          192.168.56.108       192.168.57.108      192.168.57.109

</pre>
</div>
<p>
Host 2中ip_forward开启后，在Host 1上 <code>ping 192.168.57.109</code> 。Host 2的eth0和eth1以及Host 3上的eth0都有icmp包。
</p>

<p>
反之，可有Host 2的eth0上才有icmp包。
</p>

<p>
ubuntu下可以这样来临时性地打开 <code>ip forward</code> ：
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #d18aff;">echo</span> 1 &gt; /proc/sys/net/ipv4/ip_forward
</pre>
</div>

<p>
永久性地打开可以这样：
</p>
<pre class="example">
    # 编辑 /etc/sysctl.conf ，找到下面的行
    #net.ipv4.ip_forward=1
    # 把这行打开 net.ipv4.ip_forward=1:

    # 或者使用一行命令搞定
    sudo sysctl -w net.ipv4.ip_forward=1
</pre>
</div>
</div>

<div id="outline-container-org9d2aefe" class="outline-2">
<h2 id="org9d2aefe"><span class="section-number-2">2</span> rp_filter</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://www.slashroot.in/linux-kernel-rpfilter-settings-reverse-path-filtering">参考的这篇博客</a>
</p>

<pre class="example">
    So in other words, when a machine with reverse path filtering enabled
    recieves a packet, the machine will first check whether the source of
    the recived packet is reachable through the interface it came in.
</pre>

<p>
以 <a href="#ip_forward">ip_forward</a> 中的图为例，Host 2开启ip_forward选项，然后它的eth0网口
开启rp_filter的情况下。在Host 1上构造如下的包发送给Host 2:
</p>
<pre class="example">
                  +-----------------------------------+-------------------------------------+
    Situation 1:  |  src:192.168.56.100               |         dts:192.168.57.109          |
                  +-----------------------------------+-------------------------------------+

                  +-----------------------------------+-------------------------------------+
    Situation 2:  |  src:10.10.10.10                  |         dts:192.168.57.109          |
                  +-----------------------------------+-------------------------------------+
</pre>

<p>
第一个包Host 2会转发到Host 3。第二个包Host 2会丢弃。 <b>原因是第二个包
的源ip在Host 2的eth0上路由不可达。</b>
</p>

<p>
临时性地打开 <code>rp_filter</code> :
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #a1db00;">for</span> i<span style="color: #a1db00;"> in</span> /proc/sys/net/ipv4/conf/*/rp_filter ; <span style="color: #a1db00;">do </span><span style="color: #d18aff;">echo</span> 1 &gt;  $<span style="color: #ff8700;">i</span>;<span style="color: #a1db00;">done</span>
</pre>
</div>

<p>
还可以这样永久性地打开eth0的 <code>rp_filter</code> 选项：
</p>
<div class="org-src-container">
<pre class="src src-sh">    sudo sysctl -w <span style="color: #ff4ea3;">"net.ipv4.conf.eth0.rp_filter=1"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>